<template>
  <b-container>
    <navbar></navbar>
    <b-row class="mx-0" style="height: 270px;background: url(/img/search.png);"></b-row>
    <search></search>
    <b-row>
      <b-col class="p-4">
        <h1>Агрегатор отходов</h1>
        <p>Цель нашего агрегатора отходов собрать абсолютно все фирмы,
     которые образуют, утилизирую, перевозят отходы и покупают, продают вторсырье</p>
        <hr class="my-4">
        <h2>Для кого создан агрегатор отходов?</h2>
        <b-card class="mt-3 mb-3" title="Для образователей отходов">
          <b-card-text>
          Если в ходе деятельности вашего предприятия образуются отходы, которые требуется
          утилизировать, то вы с легкостью сможете это сделать через наш агрегатор отходов.
          </b-card-text>
          <b-card-text>
          Размещайте заявки на утилизацию – Вы всего лишь один раз заполняете форму заявки
           на утилизацию отходов, прикрепляете фотографии отходов, ТЗ и описываете максимально
           подробно всю требуемую информацию для получения предварительного расчета.
           Для уточнения информации наши менеджеры с вами созваниваются, уточняют все нюансы,
           и запускают заявку в работу. Утилизаторы или транспортные компании в свою очередь
           видят необходимость утилизировать, обезвредить или перевезти отходы и начинают,
           основываясь на полученной информации, создавать отклики с ценой предварительного
           расчета. При этом никакие навигационные данные: контактное лицо, почта, телефон или
           адрес контрагенты не видят. Вы в свою очередь видите абсолютно все отклики и
           предварительный расчет, если вы нашли оптимальное для себя предложение со стороны
           контрагентов, даёте согласие на работу именно с этим контрагентом. Утилизатору или
           транспортной компании отправляются ваши контактные данные и дальше вы уже работаете
           напрямую, с коммерческими предложения и заключением договоров. Выставляете дату
           окончания заявки и другие требуемые вами условия.
           </b-card-text>
        </b-card>

        <b-card class="mt-3 mb-3" title="Для утилизаторов отходов и транспортных компаний">
          <b-card-text>
          Вы занимаетесь утилизацией или транспортировкой отходов?
          Для вас у нас есть вариант лидогенерации:
          </b-card-text>
          <b-card-text>
          Лидогенерация образователей отходов – регистрируясь у нас вы можете получать потенциальных
          клиентов по видам отходов, на которые у вас есть лицензия. Мы в автоматическом режиме
          с ежедневным обновлением получаем список фирм и кодов ФККО, по которым может работать
          фирма. Вы сможете предлагать цену на утилизацию или транспортировку потенциальным
          клиентам, и в случае, если ваше предложение является наиболее оптимальным и вас выбирает
          образователь отходов, вы получаете контактные данные тем самым получаете клиента и
          зарабатываете на этом деньги.
           </b-card-text>
        </b-card>

        <b-card class="mt-3 mb-3" title="Для продавцов вторсырья">
          <b-card-text>
          Вы уже сейчас занимаетесь сбором и предварительной подготовкой вторсырья или же продаете
           готовый продукт переработки. Дальше возникает проблема, кому вашу продукцию продать,
           а еще и по максимально выгодной цене?
          </b-card-text>
          <b-card-text>
          Выход есть, размещайте своё вторсырье на в нашем агрегаторе отходов, выставляйте цену,
          за которую готовы продать и ждите откликов от покупателей.
           </b-card-text>
        </b-card>

        <b-card class="mt-3 mb-3" title="Для покупателей вторсырья">
          <b-card-text>
          У вас есть производство, в котором присутствует компонент из переработки
          вторсырья или вы используете вторсырье для иных целей? Смотрите предложения
          от продавцов вторсырья с ценами, объёмом и всеми необходимыми параметрами.
          Выбирайте подходящие вам предложения и заключайте договора на выгодных для
          себя условиях.
          </b-card-text>
        </b-card>
     </b-col>
    </b-row>
    <cmp-footer></cmp-footer>
  </b-container>
</template>

<script>
export default {
  data () {
    return {
      loggedIn: this.$auth.loggedIn,
    }
  },
}
</script>

<style>

.autosuggest__results ul {
  width: 100%;
  color: rgba(30, 39, 46,1.0);
  list-style: none;
  margin: 0;
  padding: 0.5rem 0 .5rem 0;
}
.autosuggest__results li {
  margin: 0 0 0 0;
  border-radius: 5px;
  padding: 0.75rem 0 0.75rem 0.75rem;
  display: flex;
  align-items: center;
}
.autosuggest__results li:hover {
  cursor: pointer;
}

#autosuggest {
  width: 95%;
  position: absolute;
  background-color: #fff;
  z-index: 9999;
}
.autosuggest__results-item--highlighted {
  background-color: rgba(40, 167, 69, 0.2);
}
</style>
